CSI API ETABS v1
cLinkObj.SetGroupAssign Method
 Adds/removes link objects to/from a specified group.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetGroupAssign(
	string Name,
	string GroupName,
	bool Remove = false,
	eItemType ItemType = eItemType.Objects
)
Function SetGroupAssign (
	Name As String,
	GroupName As String,
	Optional Remove As Boolean = false,
	Optional ItemType As eItemType = eItemType.Objects
) As Integer
Dim instance As cLinkObj
Dim Name As String
Dim GroupName As String
Dim Remove As Boolean
Dim ItemType As eItemType
Dim returnValue As Integer
returnValue = instance.SetGroupAssign(Name,
	GroupName, Remove, ItemType)
int SetGroupAssign(
	String^ Name,
	String^ GroupName,
	bool Remove = false,
	eItemType ItemType = eItemType::Objects
)
abstract SetGroupAssign :
        Name : string *
        GroupName : string *
        ?Remove : bool *
        ?ItemType : eItemType
(* Defaults:
        let _Remove = defaultArg Remove false
        let _ItemType = defaultArg ItemType eItemType.Objects
*)
-> int
Parameters
Name
Type: System.String
The name of an existing link object or group, depending on the value of the ItemType item.
GroupName
Type: System.String
The name of an existing group to which the assignment is made.
Remove (Optional)
Type: System.Boolean
If this item is False, the specified link objects are added to the group specified by the GroupName item. If it is True, the link objects are removed from the group.
ItemType (Optional)
Type: ETABSv1.eItemType
This is one of the items in the eItemType enumeration.
If this item is Objects, the link object specified by the Name item is added/removed to/from the group specified by the GroupName item.
If this item is Group, the link objects in the group specified by the Name item is added/removed to/from the group specified by the GroupName item.
If this item is SelectedObjects, all selected link objects are added/removed to/from the group specified by the GroupName item, and the Name item is ignored.
Return Value
Type: Int32
Returns zero if the group assignment is successful; otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim Name As String
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'add link object by points
       ret = SapModel.LinkObj.AddByPoint("1", "5", Name)
   'define new group
       ret = SapModel.GroupDef.SetGroup("Group1")
   'add link object to group
       ret = SapModel.LinkObj.SetGroupAssign(Name, "Group1")
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cLinkObj Interface
ETABSv1 Namespace